assignment1/benchmarks/localmachine/disk_benchmark_randread_2017-06-12:20:40:55.out
randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-2.20
Starting 4 processes
randread: Laying out IO file (1 file / 64MiB)
randread: Laying out IO file (1 file / 64MiB)
randread: Laying out IO file (1 file / 64MiB)
[...]

randread: (groupid=0, jobs=4): err= 0: pid=61365: Mon Jun 12 20:41:38 2017
   read: IOPS=830k, BW=3241MiB/s (3398MB/s)(256MiB/79msec)
    clat (usec): min=1, max=11167, avg= 3.40, stdev=72.18
     lat (usec): min=1, max=11167, avg= 3.54, stdev=72.38
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    2], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    3], 90.00th=[    3], 95.00th=[    4],
     | 99.00th=[    5], 99.50th=[    7], 99.90th=[  126], 99.95th=[  251],
     | 99.99th=[ 2576]
    lat (usec) : 2=3.30%, 4=91.66%, 10=4.63%, 20=0.09%, 50=0.12%
    lat (usec) : 100=0.06%, 250=0.09%, 500=0.02%, 750=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=24.15%, sys=44.56%, ctx=334, majf=0, minf=93
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=65536,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3241MiB/s (3398MB/s), 3241MiB/s-3241MiB/s (3398MB/s-3398MB/s), io=256MiB (268MB), run=79-79msec