assignment1/benchmarks/localmachine/disk_benchmark_randread_2017-06-16:08:26:37.out
randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-2.20
Starting 4 processes
randread: Laying out IO file (1 file / 64MiB)
randread: Laying out IO file (1 file / 64MiB)
randread: Laying out IO file (1 file / 64MiB)
[...]

randread: (groupid=0, jobs=4): err= 0: pid=45258: Fri Jun 16 08:27:12 2017
   read: IOPS=1170k, BW=4571MiB/s (4793MB/s)(256MiB/56msec)
    clat (usec): min=1, max=2084, avg= 2.42, stdev= 8.43
     lat (usec): min=1, max=2084, avg= 2.54, stdev= 8.44
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    2], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    3], 80.00th=[    3], 90.00th=[    3], 95.00th=[    4],
     | 99.00th=[    5], 99.50th=[    5], 99.90th=[    6], 99.95th=[    7],
     | 99.99th=[   53]
    lat (usec) : 2=2.13%, 4=91.03%, 10=6.80%, 20=0.02%, 50=0.02%
    lat (usec) : 100=0.01%, 500=0.01%
    lat (msec) : 4=0.01%
  cpu          : usr=34.11%, sys=62.62%, ctx=22, majf=0, minf=92
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=65536,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=4571MiB/s (4793MB/s), 4571MiB/s-4571MiB/s (4793MB/s-4793MB/s), io=256MiB (268MB), run=56-56msec