assignment1/benchmarks/localmachine/disk_benchmark_randrw_2017-06-12:20:40:55.out
randrw: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-2.20
Starting 4 processes
randrw: Laying out IO file (1 file / 64MiB)
randrw: Laying out IO file (1 file / 64MiB)
randrw: Laying out IO file (1 file / 64MiB)
[...]

randrw: (groupid=0, jobs=4): err= 0: pid=61377: Mon Jun 12 20:41:40 2017
   read: IOPS=484k, BW=1890MiB/s (1982MB/s)(129MiB/68msec)
    clat (usec): min=1, max=1065, avg= 2.73, stdev=12.63
     lat (usec): min=1, max=1065, avg= 2.85, stdev=12.72
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    2], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    3], 80.00th=[    3], 90.00th=[    3], 95.00th=[    3],
     | 99.00th=[    4], 99.50th=[    7], 99.90th=[   99], 99.95th=[  201],
     | 99.99th=[  644]
  write: IOPS=480k, BW=1875MiB/s (1966MB/s)(127MiB/68msec)
    clat (usec): min=1, max=3039, avg= 3.02, stdev=20.06
     lat (usec): min=1, max=3040, avg= 3.18, stdev=20.14
    clat percentiles (usec):
     |  1.00th=[    2],  5.00th=[    2], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    3], 60.00th=[    3],
     | 70.00th=[    3], 80.00th=[    3], 90.00th=[    3], 95.00th=[    3],
     | 99.00th=[    5], 99.50th=[   11], 99.90th=[  105], 99.95th=[  191],
     | 99.99th=[  474]
    lat (usec) : 2=0.58%, 4=96.01%, 10=2.93%, 20=0.16%, 50=0.17%
    lat (usec) : 100=0.06%, 250=0.06%, 500=0.03%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%
  cpu          : usr=30.04%, sys=56.52%, ctx=450, majf=0, minf=94
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=32903,32633,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1890MiB/s (1982MB/s), 1890MiB/s-1890MiB/s (1982MB/s-1982MB/s), io=129MiB (135MB), run=68-68msec
  WRITE: bw=1875MiB/s (1966MB/s), 1875MiB/s-1875MiB/s (1966MB/s-1966MB/s), io=127MiB (134MB), run=68-68msec