assignment1/benchmarks/localmachine/disk_benchmark_randrw_2017-06-16:08:26:37.out
randrw: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-2.20
Starting 4 processes
randrw: Laying out IO file (1 file / 64MiB)
randrw: Laying out IO file (1 file / 64MiB)
randrw: Laying out IO file (1 file / 64MiB)
[...]

randrw: (groupid=0, jobs=4): err= 0: pid=45270: Fri Jun 16 08:27:14 2017
   read: IOPS=567k, BW=2216MiB/s (2324MB/s)(129MiB/58msec)
    clat (usec): min=1, max=139, avg= 2.40, stdev= 1.20
     lat (usec): min=1, max=140, avg= 2.51, stdev= 1.22
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    2], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    3], 80.00th=[    3], 90.00th=[    3], 95.00th=[    4],
     | 99.00th=[    5], 99.50th=[    5], 99.90th=[    7], 99.95th=[   10],
     | 99.99th=[   51]
  write: IOPS=563k, BW=2198MiB/s (2305MB/s)(127MiB/58msec)
    clat (usec): min=1, max=276, avg= 2.72, stdev= 3.23
     lat (usec): min=2, max=276, avg= 2.87, stdev= 3.24
    clat percentiles (usec):
     |  1.00th=[    2],  5.00th=[    2], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    3], 60.00th=[    3],
     | 70.00th=[    3], 80.00th=[    3], 90.00th=[    3], 95.00th=[    4],
     | 99.00th=[    5], 99.50th=[    5], 99.90th=[   14], 99.95th=[   51],
     | 99.99th=[  175]
    lat (usec) : 2=0.52%, 4=93.53%, 10=5.84%, 20=0.05%, 50=0.02%
    lat (usec) : 100=0.02%, 250=0.02%, 500=0.01%
  cpu          : usr=34.96%, sys=63.72%, ctx=39, majf=0, minf=92
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=32903,32633,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=2216MiB/s (2324MB/s), 2216MiB/s-2216MiB/s (2324MB/s-2324MB/s), io=129MiB (135MB), run=58-58msec
  WRITE: bw=2198MiB/s (2305MB/s), 2198MiB/s-2198MiB/s (2305MB/s-2305MB/s), io=127MiB (134MB), run=58-58msec