assignment1/benchmarks/localmachine/disk_benchmark_read_2017-06-12:20:40:55.out
read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-2.20
Starting 4 processes
read: Laying out IO file (1 file / 64MiB)
read: Laying out IO file (1 file / 64MiB)
read: Laying out IO file (1 file / 64MiB)
[...]

read: (groupid=0, jobs=4): err= 0: pid=61347: Mon Jun 12 20:41:35 2017
   read: IOPS=1130k, BW=4414MiB/s (4628MB/s)(256MiB/58msec)
    clat (usec): min=1, max=5517, avg= 2.59, stdev=27.43
     lat (usec): min=1, max=5517, avg= 2.70, stdev=27.44
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    2], 90.00th=[    3], 95.00th=[    3],
     | 99.00th=[    4], 99.50th=[    5], 99.90th=[   44], 99.95th=[  147],
     | 99.99th=[  628]
    lat (usec) : 2=5.69%, 4=89.72%, 10=4.29%, 20=0.11%, 50=0.09%
    lat (usec) : 100=0.02%, 250=0.04%, 500=0.02%, 750=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=27.27%, sys=56.36%, ctx=240, majf=5, minf=93
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=65536,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=4414MiB/s (4628MB/s), 4414MiB/s-4414MiB/s (4628MB/s-4628MB/s), io=256MiB (268MB), run=58-58msec