assignment1/benchmarks/localmachine/disk_benchmark_read_2017-06-16:08:26:37.out
read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-2.20
Starting 4 processes
read: Laying out IO file (1 file / 64MiB)
read: Laying out IO file (1 file / 64MiB)
read: Laying out IO file (1 file / 64MiB)
[...]

read: (groupid=0, jobs=4): err= 0: pid=45240: Fri Jun 16 08:27:10 2017
   read: IOPS=555k, BW=2169MiB/s (2275MB/s)(256MiB/118msec)
    clat (usec): min=1, max=5265, avg= 5.27, stdev=59.79
     lat (usec): min=1, max=5265, avg= 5.41, stdev=60.04
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    3], 90.00th=[    3], 95.00th=[    4],
     | 99.00th=[    9], 99.50th=[   90], 99.90th=[  956], 99.95th=[ 1544],
     | 99.99th=[ 2224]
    lat (usec) : 2=5.49%, 4=87.69%, 10=5.82%, 20=0.16%, 50=0.18%
    lat (usec) : 100=0.18%, 250=0.20%, 500=0.10%, 750=0.05%, 1000=0.04%
    lat (msec) : 2=0.08%, 4=0.01%, 10=0.01%
  cpu          : usr=16.75%, sys=40.05%, ctx=954, majf=3, minf=95
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=65536,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=2169MiB/s (2275MB/s), 2169MiB/s-2169MiB/s (2275MB/s-2275MB/s), io=256MiB (268MB), run=118-118msec