assignment1/benchmarks/localmachine/disk_benchmark_readwrite_2017-06-12:20:40:55.out
readwrite: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-2.20
Starting 4 processes
readwrite: Laying out IO file (1 file / 64MiB)
readwrite: Laying out IO file (1 file / 64MiB)
readwrite: Laying out IO file (1 file / 64MiB)
[...]

readwrite: (groupid=0, jobs=4): err= 0: pid=61359: Mon Jun 12 20:41:37 2017
   read: IOPS=214k, BW=835MiB/s (875MB/s)(129MiB/154msec)
    clat (usec): min=0, max=4039, avg= 4.36, stdev=50.52
     lat (usec): min=0, max=4039, avg= 4.66, stdev=53.04
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    3], 90.00th=[    4], 95.00th=[    5],
     | 99.00th=[   12], 99.50th=[   27], 99.90th=[  564], 99.95th=[  980],
     | 99.99th=[ 1944]
  write: IOPS=212k, BW=828MiB/s (868MB/s)(127MiB/154msec)
    clat (usec): min=1, max=7934, avg=10.56, stdev=165.92
     lat (usec): min=1, max=7934, avg=10.87, stdev=166.33
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    3], 80.00th=[    3], 90.00th=[    3], 95.00th=[    4],
     | 99.00th=[   22], 99.50th=[  302], 99.90th=[ 2704], 99.95th=[ 4256],
     | 99.99th=[ 6944]
    lat (usec) : 2=8.20%, 4=81.70%, 10=8.72%, 20=0.47%, 50=0.39%
    lat (usec) : 100=0.08%, 250=0.09%, 500=0.13%, 750=0.08%, 1000=0.05%
    lat (msec) : 2=0.04%, 4=0.04%, 10=0.03%
  cpu          : usr=11.93%, sys=27.19%, ctx=1017, majf=0, minf=98
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=32903,32633,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=835MiB/s (875MB/s), 835MiB/s-835MiB/s (875MB/s-875MB/s), io=129MiB (135MB), run=154-154msec
  WRITE: bw=828MiB/s (868MB/s), 828MiB/s-828MiB/s (868MB/s-868MB/s), io=127MiB (134MB), run=154-154msec